taile2007/nRF52-ADS1299/main.c
	/**< SPI configuration */
	nrf_drv_spi_config_t spi_config = NRF_DRV_SPI_DEFAULT_CONFIG;
	//spi_config.ss_pin = CS; 			//< pin 12
	spi_config.miso_pin = 12;//SPI_MISO_PIN; DOUT
	spi_config.mosi_pin = 13;//SPI_MOSI_PIN; DIN
	spi_config.sck_pin = 14;//SPI_SCK_PIN; 
	spi_config.bit_order = NRF_DRV_SPI_BIT_ORDER_MSB_FIRST;
  spi_config.mode = NRF_DRV_SPI_MODE_1; 						// Clock polarity is 0 and clock phase (CHPA) = 1; MODE_0, so CPHA = 1.
  spi_config.frequency = NRF_DRV_SPI_FREQ_4M; 			// 2MB for datarate
	spi_config.irq_priority = APP_IRQ_PRIORITY_HIGH,
	spi_config.orc = 0x00; 														///< Over-run character. for 0xFF
	APP_ERROR_CHECK(nrf_drv_spi_init(&spi, &spi_config, spi_event_handler, NULL));
	NRF_LOG_INFO( "SPI example started.\r\n");	
}
//****** Power Up ADS  ******
void Reset_ADS(void)
{
	nrf_gpio_pin_set(PWDN);
	nrf_delay_us(100000);
	nrf_gpio_pin_clear(PWDN);
	nrf_delay_us(100000);
	nrf_gpio_pin_set(PWDN);
	nrf_delay_us(100000);
}
void PowerUp_ADS(void)
{
	//** Power Up and Digital Power Up **
	nrf_delay_us(1000000);					//Delay 1s for Power Up
	nrf_delay_us(400000); // // Delay t_por = 2^16 x t_CLK of ADS (1/2.048MHz)=0.032s => Delay 40ms CHECK!!!!
	nrf_gpio_pin_clear(RESET);
	nrf_delay_us(1); // // // Delay 2 x t_CLK of ADS = 2x(1/2.048MHz)=0.977us CHECK!!!!
	nrf_gpio_pin_set(RESET);
	nrf_delay_us(10); // // Delay 18 x t_CLK of ADS = 18x(1/2.048MHz)=8.789us to start using the Device CHECK!!!!
	nrf_delay_us(1000000);					//Delay 1s for Power-on Reset
}

//****** RREG Command ADS  ******
// How to read data back from slave???????
uint8_t RREG_ADS(uint8_t address)
{
		dataToSend[0] = address | 0x20;				//Opcode 000n nnnn =0 : write n channels
		dataToSend[1] = 0x00;								// specify how many registers used
  
	  nrf_gpio_pin_clear(CS); // enable SS pin for ADS
	
		if(DEBUG){NRF_LOG_INFO("Read from DR register of ADS\r\n");NRF_LOG_FLUSH();}
	  // Reset rx buffer and transfer done flag
	  spi_xfer_done = false; memset(m_rx_buf,0,sizeof(m_rx_buf));
    APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, dataToSend, 2, m_rx_buf, 1));
	  while (!spi_xfer_done){__WFE();}
	  NRF_LOG_FLUSH();
		
		// send dummy bytes		
		if(DEBUG){NRF_LOG_INFO("Send dummy bytes_for RREG_ADS\r\n");NRF_LOG_FLUSH();}
	  spi_xfer_done = false; memset(m_rx_buf,0,sizeof(m_rx_buf));
	  APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, 0x00, 1, m_rx_buf,1));  
	  while (!spi_xfer_done){__WFE();}
	  NRF_LOG_FLUSH();  
		nrf_delay_us(15);
		nrf_gpio_pin_set(CS); // disable SS pin for ADS
		return m_rx_buf[0];	
}

//****** Regcognize ADS1299  ******
uint8_t ADS_ID; uint16_t reg_count; uint8_t test[4];
uint8_t i;
void Recognize_ADS(void)
{	
  ADS_ID = RREG_ADS(0x00);
/*
	for (i = 0; i < 4; i++)
	{
		test[i] = *(ADS_ID +i);
		if(DEBUG){NRF_LOG_INFO("ADS_ID[%d]: %X\r\n",(uint32_t)i, (uint32_t)test[i]); NRF_LOG_FLUSH();}
	}
*/
	if ((ADS_ID & 0x0f)==0x0e) // 0x0e is for 1299-8, 0x0c is for 1299-4
	{
		for (reg_count=0;reg_count<50;reg_count++)
		{
			bsp_board_led_invert(1);
      nrf_delay_ms(50);
		}
	//	bsp_board_led_invert(BSP_BOARD_LED_3);
	}
}

void Send_Data_uint24 (uint32_t data)
{
	uint8_t a=0,b=0,c=0;
	uint32_t err_code;
	a = (data/65536);
	b = (data%65536)/256;
	c = (data%65536)%256;
	err_code = app_uart_put(a);
	err_code = app_uart_put(b);
	err_code = app_uart_put(c);
}

void Send_Data_uint32 (uint32_t data)
{
	uint8_t a=0,b=0,c=0, d =0;
	uint32_t err_code;
	a=(data/16777216);
	b=(data%16777216)/65536;
	c=((data%16777216)%65536)/256;
	d=((data%16777216)%65536)%256;
	err_code = app_uart_put(a);
	err_code = app_uart_put(b);
	err_code = app_uart_put(c);
	err_code = app_uart_put(d);
}

void Send_Header(uint16_t head1, uint16_t head2)
{
	uint32_t err_code;
	err_code = app_uart_put(head1);
	err_code = app_uart_put(head2);
	//err_code = app_uart_put(head2);
	//err_code = app_uart_put(head1);
}
//****** GetData in RDATA mode  ******
void GetData_RDATA(void)
{
	uint8_t countbytes;
	uint8_t countbits;
	uint32_t data_raw[10][10];
	uint8_t temp_data[1];
	uint32_t dataChn[10];
	while(nrf_gpio_pin_read(DRDY) != 0); // wait for DRDY is low to indicate data ready for transmit
	m_tx_buf[0] = 0x12;
	nrf_gpio_pin_clear(CS);  // enable SS pin for ADS
	
	// Send Command RDATA: send RDATA opcode
	if(DEBUG){NRF_LOG_INFO("Send Command RDATA\r\n");NRF_LOG_FLUSH();}
	spi_xfer_done = false; memset(m_rx_buf,0,sizeof(m_rx_buf));
	APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, m_tx_buf, 1, m_rx_buf, sizeof(m_rx_buf)));  
	while (!spi_xfer_done){__WFE();}
	NRF_LOG_FLUSH();
	
	for (countbytes = 1; countbytes < 10; countbytes++)
	{
		for (countbits = 3; countbits > 0; countbits--)
		{
			if(DEBUG){NRF_LOG_INFO("getdata_RDATA");NRF_LOG_FLUSH();}
		  spi_xfer_done = false; memset(m_rx_buf,0,sizeof(m_rx_buf));
			APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, 0x00, 1, temp_data, 1));
			data_raw[countbytes][countbits] = temp_data[0];	
		  while (!spi_xfer_done){__WFE();}
		  NRF_LOG_FLUSH();	
					
			dataChn[countbytes] = dataChn[countbytes]|(data_raw[countbytes][countbits]<<((countbits-1)*8));
		}
		if (countbytes!=1)
			{
				if (dataChn[countbytes] > 0x007fffff)
				{
					dataChn[countbytes] = 0x00ffffff - dataChn[countbytes];
				}
				else 
				{
					dataChn[countbytes] = dataChn[countbytes] + 0x00800000;	
				}
			}
		
	}
	for (countbytes=1;countbytes<10;countbytes++)
	{
	//	Send_Data_uint24(dataChn[countbytes]);
	}
}


//****** Send other Command to ADS with appropriated time  ******
void SendADSCommand(uint8_t data, uint32_t delaytime)
{
	  nrf_gpio_pin_clear(CS); // enable SS pin for ADS
		spiDataTx[0] = data;
		if(DEBUG){NRF_LOG_INFO("SendADSCommand\r\n");NRF_LOG_FLUSH();}
	  spi_xfer_done = false; memset(m_rx_buf,0,sizeof(m_rx_buf));
	  APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, spiDataTx, 1, m_rx_buf, 1));  
	  while (!spi_xfer_done){__WFE();}
	  NRF_LOG_FLUSH();

	  nrf_delay_us(delaytime); // Check TIME DELAY HERE????
	  nrf_gpio_pin_set(CS); // disable SS pin for ADS
}

/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
//****** GetData in RDATAC mode  ******
void GetData_RDATAC(void)
{
	uint8_t count = 0;
	SendADSCommand(0x10,2);
	dataToSend[0] = 0x00;
	uint8_t dummyData[1] = {0x00};
	if(DEBUG){NRF_LOG_INFO("getdata_RDATAC");NRF_LOG_FLUSH();}
	
	while(1)
	{
		while(nrf_gpio_pin_read(DRDY) != 0x00) // wait for DRDY is low to indicate data ready for transmit 
		nrf_gpio_pin_clear(CS);  // enable SS pin for ADS	
		spi_xfer_done = false; memset(m_rx_buf,0,sizeof(m_rx_buf));
		APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi, 0x00, 1, m_rx_buf,sizeof(m_rx_buf)));  
		while (!spi_xfer_done){__WFE();}
		NRF_LOG_FLUSH();
		nrf_gpio_pin_set(CS); // disable SS pin for ADS
		count = count +1;
		m_rx_buf[len_data_send-1] = count;
		ble_nus_string_send(&m_nus, m_rx_buf, len_data_send);
	}
	
