taile2007/nRF52-ADS1299/main.c
    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;
    bool     erase_bonds;

    // Initialize.
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    uart_init();
    log_init();

    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    printf("\r\nUART Start!\r\n");
    NRF_LOG_INFO("UART Start!\r\n");
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

    // Enter main loop.
//    for (;;)
//    {
//        power_manage();
//    }
		mySPI_int();
		Reset_ADS();
		PowerUp_ADS(); 						// Power up ADS: Delay for system startup and reset ADS1299 chip
		SendADSCommand(0x11,2);		// Send Command SDATA: STOP RDATAC mode
		Recognize_ADS();					// Check the ADS device ID. If the ID is corrent, blink the LED.
		//uint8_t PGA[4] = {0x60, 0x50, 0x40, 0x30}; 
		WREG_ADS(0x01,0xD6);			//Config1: Daisy Chain Mode, Oscillator output disable, DT 250SPS. 1101 0110 250 normal > 1101 0101 500sps. 6 250. 5 500
		WREG_ADS(0x02,0xC0);			//Config2: Test Signals are driven Externally, Test Signal and Amplitude are Default
		WREG_ADS(0x03,0xE1);			//Config3: Unsing Internal Reference
		WREG_ADS(0x05,0x60);			//Channel 1-8: Normal Operation;PGA=24 ;SRB2 off;Normal electrode input 101 for Gain 12, and 110 for Gain 24
		WREG_ADS(0x06,0x60);			// Channel 2: 0110 0000 gain 24
		WREG_ADS(0x07,0x60);			//-
		WREG_ADS(0x08,0x60);			//-
//		WREG_ADS(0x09,0x30);			//-
//		WREG_ADS(0x0A,0x30);			//-
//		WREG_ADS(0x0B,0x30);			//-
//		WREG_ADS(0x0C,0x30);
		WREG_ADS(0x0D,0x50);
		WREG_ADS(0x0E,0x50);//-8
		
		//LOFF setup
		WREG_ADS(0x04,0x02);			// 04h LOFF: 000.0.00.10 Current source signal: 31Hz, 6nA > 1010 - 6uA 31Hz
		WREG_ADS(0x0F,0x00);			//Turn on current source for all P channel; turn on channel 1 to 4 // Connected all negative pin to SRB1 (0x20)
		WREG_ADS(0x10,0x00);			// Turn off current source for all N channel
		WREG_ADS(0x11,0x00);			// No flipping current sourcee			
		
		//* Square wave test signal 

//		WREG_ADS(0x02,0xD5);			//// 1101.0000 Internal signal test bit 4, test signal amplitude default. pulsed at default
//		WREG_ADS(0x05,0x05);
//		WREG_ADS(0x06,0x05);
//		WREG_ADS(0x07,0x04);			// For temperature sensors
//		WREG_ADS(0x08,0x05);
//		WREG_ADS(0x09,0x05);
//		WREG_ADS(0x0A,0x05);
//		WREG_ADS(0x0B,0x05);
//		WREG_ADS(0x0C,0x05);

		nrf_gpio_pin_set(START_01); //Enable START, then /DRDY toggle at f_CLK/8192 =>t=4ms
		nrf_delay_us(10);
		//GetData_RDATA();
		GetData_RDATAC();
}


/**
 * @}
 */
